Assignment Instructions:

1.Design a relational database for an education system, which fulfils the following requirements:

* Information of departments, programs, students, teachers and courses are stored in the databases.
* The relationships of departments, programs, students, teachers and courses are stored in the databases.
* Departments provide different programs. Each program belongs to one department.
* Each course has at least one teacher. It is possible that one course has two or more teachers. And each course is hosted by one department.
* Each teacher belongs to one department.
* Each program has several courses. It is possible that one course is shared by two or more different programs.
* Each student belongs to one program.
* At one semester, students can choose different courses which belong to their programs.
* There are mandatory and elective courses. It is possible for a student to choose elective courses from other programs.
* Each course has its own credits.
* There is a maximam limit of total credits that students can get in one semester. This means there is a limit of number of courses one student can chose at each semester.
* Some courses have pre-course requirements. And some courses cannot be chosen at the same time.
* Design queries that are useful for teachers, students, student adminitrators. For example, how many credits a student has obtained? how many are mandatory credits? How many more mandatory/elective credits s/he has to obtain to graduate?

2.To design a databse step by step, read this [Quick-Start Tutorial on Relational Database Design](https://www.ntu.edu.sg/home/ehchua/programming/sql/Relational_Database_Design.html).
 

3.Create tables based on your design for this education system in the provided empty SQLite database "empty_db.db". For each table, the description of table and the corresponding create sql need to be listed in the notebook. One simple example has been given.

* Rename the db file as ""
* Command for "show tables" with ipython-sql: "%sql SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;"
* Command for "describe tables" with ipython-sql: "%sql PRAGMA table_info(Table_Name);"
* If working with a shell or DOS prompt, Sqlite also provides command ".tables" and ".schema Table_Name".
* More information on Sqlite can be found at [Sqlite Quick Start](https://sqlite.org/quickstart.html)

In [27]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Example:

Table: student

Description: Information of students are stored in this table, such as name and email.

In [28]:
%sql sqlite:///A3database.db

u'Connected: None@A3database.db'

## Creating Tables and Inserting Data

In [29]:
%%sql 
DROP TABLE IF EXISTS department;
CREATE TABLE department (
    dID int NOT NULL UNIQUE,
    name varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(dID)
);
INSERT INTO department VALUES (1, "Economy"), (2, "Science");
select *
from department

Done.
Done.
2 rows affected.
Done.

[(1, u'Economy'), (2, u'Science')]

In [30]:
%%sql
DROP TABLE IF EXISTS course;
CREATE TABLE course (
    cID int NOT NULL UNIQUE,
    name varchar(255) NOT NULL DEFAULT '',
    credits int CHECK (credits<=10) NOT NULL,
    mandatory bool,
    PRIMARY KEY(cID)
);

INSERT INTO course VALUES (1, "Economy", 5, 1), 
                            (2, "ComputerScience", 10, 1), 
                            (3, "Math", 10, 1),
                            (4, "Database", 10, 1), 
                            (5, "DiscreteMath", 10, 1),
                            (6, "Physichs", 10, 0);
select *
from course

Done.
Done.
6 rows affected.
Done.

[(1, u'Economy', 5, 1),
 (2, u'ComputerScience', 10, 1),
 (3, u'Math', 10, 1),
 (4, u'Database', 10, 1),
 (5, u'DiscreteMath', 10, 1),
 (6, u'Physichs', 10, 0)]

In [31]:
%%sql
DROP TABLE IF EXISTS program;
CREATE TABLE program (
    pID int NOT NULL UNIQUE,
    dID int,
    name varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(pID),
    FOREIGN KEY (dID) REFERENCES department(dID)
);

INSERT INTO program VALUES (1, 2, "Computer"), 
                            (2, 2, "Auto"), 
                            (3, 2, "Electro"),
                            (4, 1, "Economy"), 
                            (5, 1, "GlobalEconomy");
select *
from program

Done.
Done.
5 rows affected.
Done.

[(1, 2, u'Computer'),
 (2, 2, u'Auto'),
 (3, 2, u'Electro'),
 (4, 1, u'Economy'),
 (5, 1, u'GlobalEconomy')]

In [32]:
%%sql 
DROP TABLE IF EXISTS student;
CREATE TABLE student (
    sID int NOT NULL UNIQUE,
    pID int,
    first_name varchar(255) NOT NULL DEFAULT '',
    last_name varchar(255) NOT NULL DEFAULT '',
    email varchar(255) NOT NULL DEFAULT '',
    credits int CHECK (credits<=30) NOT NULL,
    PRIMARY KEY(sID),
    FOREIGN KEY (pID) REFERENCES program(pID)
);
INSERT INTO student VALUES (1, 2, "Olav", "Telseth", "olav@ntnu.stud.no", 0), 
                            (2, 2, "Simon", "Synnes", "simon@ntnu.stud.no", 0), 
                            (3, 2, "Einar", "Weltan", "einar@ntnu.stud.no", 0);
select *
from student

Done.
Done.
3 rows affected.
Done.

[(1, 2, u'Olav', u'Telseth', u'olav@ntnu.stud.no', 0),
 (2, 2, u'Simon', u'Synnes', u'simon@ntnu.stud.no', 0),
 (3, 2, u'Einar', u'Weltan', u'einar@ntnu.stud.no', 0)]

In [33]:
%%sql 
DROP TABLE IF EXISTS teacher;
CREATE TABLE teacher (
    tID int NOT NULL UNIQUE,
    dID int NOT NULL,
    first_name varchar(255) NOT NULL DEFAULT '',
    last_name varchar(255) NOT NULL DEFAULT '',
    email varchar(255) NOT NULL DEFAULT '',
    PRIMARY KEY(tID),
    FOREIGN KEY (dID) REFERENCES department (dID)
);
INSERT INTO teacher VALUES (1, 2, "Hao", "Wang", "Wang@Mail.no"), 
                            (2, 2, "Girts", "Strazdin", "Strazdin@Mail.no"), 
                            (3, 2, "Bob", "Bobbyson", "Bobbyson@Mail.no");
select *
from teacher

Done.
Done.
3 rows affected.
Done.

[(1, 2, u'Hao', u'Wang', u'Wang@Mail.no'),
 (2, 2, u'Girts', u'Strazdin', u'Strazdin@Mail.no'),
 (3, 2, u'Bob', u'Bobbyson', u'Bobbyson@Mail.no')]

### Making the relation tables

In [59]:
%%sql
DROP TABLE IF EXISTS enrollment;
CREATE TABLE enrollment (
    sID int NOT NULL,
    cID int NOT NULL,
    grade int,
    PRIMARY KEY(sID, cID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (sID) REFERENCES student(sID)
);

INSERT INTO enrollment VALUES (1, 2, 5), (2, 2, 4), (3, 2, 6), (1, 1, 3), (2, 1, 5), (1, 6, 6);
select *
from enrollment

Done.
Done.
6 rows affected.
Done.

[(1, 2, 5), (2, 2, 4), (3, 2, 6), (1, 1, 3), (2, 1, 5), (1, 6, 6)]

In [48]:
%%sql
DROP TABLE IF EXISTS lecture;
CREATE TABLE lecture (
    cID int NOT NULL,
    tID int NOT NULL,
    PRIMARY KEY(cID, tID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (tID) REFERENCES teacher(tID)
);

INSERT INTO lecture VALUES (1, 1), (2, 2), (3, 3), (2, 1);
select *
from lecture;

Done.
Done.
4 rows affected.
Done.

[(1, 1), (2, 2), (3, 3), (2, 1)]

In [36]:
%%sql
DROP TABLE IF EXISTS courses;
CREATE TABLE courses (
    cID int NOT NULL,
    pID int NOT NULL,
    PRIMARY KEY(cID, pID),
    FOREIGN KEY (cID) REFERENCES course(cID),
    FOREIGN KEY (pID) REFERENCES program(pID)
);

INSERT INTO courses VALUES (1, 1), (1, 2);
select *
from courses;

Done.
Done.
2 rows affected.
Done.

[(1, 1), (1, 2)]

## Queries

#### Query for updating the student credits

In [60]:
%%sql
update student
set credits = (select sum(credits) from course, enrollment where course.cID = enrollment.cID and enrollment.sID = student.sID);

select *
from student;

3 rows affected.
Done.

[(1, 2, u'Olav', u'Telseth', u'olav@ntnu.stud.no', 25),
 (2, 2, u'Simon', u'Synnes', u'simon@ntnu.stud.no', 15),
 (3, 2, u'Einar', u'Weltan', u'einar@ntnu.stud.no', 10)]

#### Query for finding credits left for each student to graduate

In [38]:
%%sql
select first_name as firstname, last_name as lastname, (30 - credits) as creditsLeft
from student
group by sID;

Done.

[(u'Olav', u'Telseth', 5),
 (u'Simon', u'Synnes', 15),
 (u'Einar', u'Weltan', 20)]

#### Query for finding current credits for each student

In [39]:
%%sql
select first_name as firstname, last_name as lastname, credits as creditsLeft
from student
group by sID;

Done.

[(u'Olav', u'Telseth', 25),
 (u'Simon', u'Synnes', 15),
 (u'Einar', u'Weltan', 10)]

#### Query for finding mandotory and elective credits

In [40]:
%%sql
select man.n1 as Name, man.tot1 as MandatoryCredits, ele.tot1 as ElectiveCredits
from (select first_name n1, sum(course.credits) as tot1 
      from student join enrollment using (sID) join course using (cID) where mandatory = 1 and first_name = "Olav") as man,
(select first_name n2, sum(course.credits) as tot1 
      from student join enrollment using (sID) join course using (cID) where mandatory = 0 and first_name = "Olav") as ele

Done.

[(u'Olav', 15, 10)]

In [41]:
%%sql
select n1 as Name, tot1 as MandatoryCredits, tot2 as ElectiveCredits, (coalesce(tot1+tot2, tot1, tot2, 0)) as Sum
from (select first_name n1, sum(course.credits) as tot1 
          from student join enrollment using (sID) 
          join course using (cID) where mandatory = 1  group by first_name) left join
    (select first_name n1, sum(course.credits) as tot2
          from student join enrollment using (sID) 
            join course using (cID) where mandatory = 0  group by first_name) using (n1)

Done.

[(u'Einar', 10, None, 10), (u'Olav', 15, 10, 25), (u'Simon', 15, None, 15)]

#### Query for finding attendees in every course

In [42]:
%%sql
select name, count(sID) as StudentsAttendingThisClass
from course left join enrollment using (cID)
group by name

Done.

[(u'ComputerScience', 3),
 (u'Database', 0),
 (u'DiscreteMath', 0),
 (u'Economy', 2),
 (u'Math', 0),
 (u'Physichs', 1)]

## Queries for getting couse information

#### Getting the teahers in ComputerScience

In [43]:
%%sql
select first_name as FirstName, last_name as LastName, email
from course join lecture using (cID) join teacher using (tID)
where course.name = "ComputerScience"

Done.

[(u'Girts', u'Strazdin', u'Strazdin@Mail.no'),
 (u'Hao', u'Wang', u'Wang@Mail.no')]

#### Getting the credits for each course

In [44]:
%%sql
select name, credits, mandatory
from course

Done.

[(u'Economy', 5, 1),
 (u'ComputerScience', 10, 1),
 (u'Math', 10, 1),
 (u'Database', 10, 1),
 (u'DiscreteMath', 10, 1),
 (u'Physichs', 10, 0)]